// Определить количество цифр в числе
// Первый способ

// Console.WriteLine("Введите число: ");
// string a = Console.ReadLine() ?? "0";

// int b = a.Length;

// Console.WriteLine($"Число {a} имеет {b} цифр");

// Второй способ - то что сделали в группе на семинаре