// Определить количество цифр в числе

Console.WriteLine("Введите число: ");
string a = Console.ReadLine();

int b = a.Length;

Console.WriteLine($"Число {a} имеет {b} цифр");

